comparison/results_reprod/dsb_other/bench100/compose_1c/out_1_281.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 517.547ms, rate sampling interval: 1647ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.68s   448.34ms   2.41s    56.53%
    Req/Sec   254.08      8.57   261.00     91.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.79s 
 75.000%    2.04s 
 90.000%    2.21s 
 99.000%    2.41s 
 99.900%    2.50s 
 99.990%    2.52s 
 99.999%    2.52s 
100.000%    2.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     923.647     0.000000            1         1.00
     995.839     0.100000          515         1.11
    1104.895     0.200000         1021         1.25
    1340.415     0.300000         1529         1.43
    1708.031     0.400000         2038         1.67
    1785.855     0.500000         2547         2.00
    1836.031     0.550000         2803         2.22
    1893.375     0.600000         3057         2.50
    1937.407     0.650000         3312         2.86
    1989.631     0.700000         3571         3.33
    2042.879     0.750000         3823         4.00
    2064.383     0.775000         3952         4.44
    2093.055     0.800000         4077         5.00
    2129.919     0.825000         4207         5.71
    2152.447     0.850000         4333         6.67
    2174.975     0.875000         4458         8.00
    2197.503     0.887500         4532         8.89
    2207.743     0.900000         4589        10.00
    2226.175     0.912500         4654        11.43
    2242.559     0.925000         4712        13.33
    2269.183     0.937500         4779        16.00
    2275.327     0.943750         4811        17.78
    2281.471     0.950000         4844        20.00
    2287.615     0.956250         4874        22.86
    2297.855     0.962500         4906        26.67
    2306.047     0.968750         4937        32.00
    2310.143     0.971875         4950        35.56
    2318.335     0.975000         4966        40.00
    2328.575     0.978125         4985        45.71
    2334.719     0.981250         4998        53.33
    2361.343     0.984375         5014        64.00
    2375.679     0.985938         5022        71.11
    2390.015     0.987500         5030        80.00
    2404.351     0.989062         5038        91.43
    2418.687     0.990625         5046       106.67
    2433.023     0.992188         5054       128.00
    2441.215     0.992969         5058       142.22
    2449.407     0.993750         5062       160.00
    2455.551     0.994531         5066       182.86
    2463.743     0.995313         5070       213.33
    2469.887     0.996094         5074       256.00
    2473.983     0.996484         5076       284.44
    2478.079     0.996875         5078       320.00
    2482.175     0.997266         5080       365.71
    2486.271     0.997656         5082       426.67
    2490.367     0.998047         5084       512.00
    2492.415     0.998242         5086       568.89
    2492.415     0.998437         5086       640.00
    2496.511     0.998633         5087       731.43
    2500.607     0.998828         5088       853.33
    2504.703     0.999023         5089      1024.00
    2504.703     0.999121         5089      1137.78
    2508.799     0.999219         5090      1280.00
    2508.799     0.999316         5090      1462.86
    2512.895     0.999414         5091      1706.67
    2512.895     0.999512         5091      2048.00
    2512.895     0.999561         5091      2275.56
    2516.991     0.999609         5092      2560.00
    2516.991     0.999658         5092      2925.71
    2516.991     0.999707         5092      3413.33
    2516.991     0.999756         5092      4096.00
    2516.991     0.999780         5092      4551.11
    2521.087     0.999805         5093      5120.00
    2521.087     1.000000         5093          inf
#[Mean    =     1676.872, StdDeviation   =      448.343]
#[Max     =     2519.040, Total count    =         5093]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7657 requests in 30.00s, 1.57MB read
Requests/sec:    255.22
Transfer/sec:     53.59KB