comparison/results_reprod/dsb_other/bench100/compose_1c/out_1_381.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 1449.351ms, rate sampling interval: 4354ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.26s   185.48ms   2.58s    64.78%
    Req/Sec   257.75      1.09   259.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.26s 
 75.000%    2.41s 
 90.000%    2.51s 
 99.000%    2.58s 
 99.900%    2.61s 
 99.990%    2.62s 
 99.999%    2.62s 
100.000%    2.62s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1734.655     0.000000            1         1.00
    2030.591     0.100000          518         1.11
    2099.199     0.200000         1044         1.25
    2154.495     0.300000         1551         1.43
    2211.839     0.400000         2074         1.67
    2263.039     0.500000         2587         2.00
    2287.615     0.550000         2842         2.22
    2316.287     0.600000         3117         2.50
    2344.959     0.650000         3360         2.86
    2377.727     0.700000         3624         3.33
    2410.495     0.750000         3885         4.00
    2426.879     0.775000         4011         4.44
    2443.263     0.800000         4136         5.00
    2461.695     0.825000         4277         5.71
    2478.079     0.850000         4398         6.67
    2494.463     0.875000         4526         8.00
    2502.655     0.887500         4586         8.89
    2510.847     0.900000         4647        10.00
    2519.039     0.912500         4714        11.43
    2527.231     0.925000         4779        13.33
    2535.423     0.937500         4842        16.00
    2539.519     0.943750         4874        17.78
    2543.615     0.950000         4904        20.00
    2549.759     0.956250         4952        22.86
    2553.855     0.962500         4979        26.67
    2557.951     0.968750         5007        32.00
    2559.999     0.971875         5017        35.56
    2564.095     0.975000         5044        40.00
    2566.143     0.978125         5055        45.71
    2570.239     0.981250         5074        53.33
    2572.287     0.984375         5086        64.00
    2574.335     0.985938         5097        71.11
    2576.383     0.987500         5106        80.00
    2576.383     0.989062         5106        91.43
    2580.479     0.990625         5121       106.67
    2582.527     0.992188         5125       128.00
    2584.575     0.992969         5129       142.22
    2586.623     0.993750         5134       160.00
    2586.623     0.994531         5134       182.86
    2590.719     0.995313         5141       213.33
    2592.767     0.996094         5143       256.00
    2594.815     0.996484         5146       284.44
    2594.815     0.996875         5146       320.00
    2596.863     0.997266         5148       365.71
    2598.911     0.997656         5150       426.67
    2603.007     0.998047         5152       512.00
    2605.055     0.998242         5153       568.89
    2607.103     0.998437         5155       640.00
    2607.103     0.998633         5155       731.43
    2611.199     0.998828         5157       853.33
    2611.199     0.999023         5157      1024.00
    2613.247     0.999121         5158      1137.78
    2613.247     0.999219         5158      1280.00
    2615.295     0.999316         5159      1462.86
    2615.295     0.999414         5159      1706.67
    2617.343     0.999512         5160      2048.00
    2617.343     0.999561         5160      2275.56
    2617.343     0.999609         5160      2560.00
    2619.391     0.999658         5161      2925.71
    2619.391     0.999707         5161      3413.33
    2619.391     0.999756         5161      4096.00
    2619.391     0.999780         5161      4551.11
    2619.391     0.999805         5161      5120.00
    2623.487     0.999829         5162      5851.43
    2623.487     1.000000         5162          inf
#[Mean    =     2259.996, StdDeviation   =      185.477]
#[Max     =     2621.440, Total count    =         5162]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7738 requests in 30.00s, 1.59MB read
Requests/sec:    257.92
Transfer/sec:     54.15KB